SpenceKonde/arduino-tiny-841/avr/boards.txt
attiny1634cb.name=ATtiny1634 (ChipBoot)
attiny1634cb.upload.maximum_size=14848
attiny1634cb.upload.maximum_data_size=1024
attiny1634cb.upload.tool=avrdude
attiny1634cb.bootloader.tool=avrdude
attiny1634cb.bootloader.unlock_bits=0x03
attiny1634cb.bootloader.lock_bits=0x03
attiny1634cb.build.mcu=attiny1634
attiny1634cb.build.core=tiny
attiny1634cb.build.board=AVR_ATTINY1634
attiny1634cb.bootloader.extended_fuses=0x1F
attiny1634cb.bootloader.high_fuses=0xD7
attiny1634cb.menu.clock.8internal=8 MHz (internal)
attiny1634cb.menu.clock.8internal.bootloader.low_fuses=0xE2
attiny1634cb.menu.clock.8internal.build.f_cpu=8000000L
attiny1634cb.menu.clock.8internal.bootloader.file=empty/empty_all.hex
attiny1634cb.menu.clock.12external=12 MHz (external)
attiny1634cb.menu.clock.12external.bootloader.low_fuses=0xEF
attiny1634cb.menu.clock.12external.build.f_cpu=12000000L
attiny1634cb.menu.clock.12external.bootloader.file=empty/empty_all.hex
attiny1634cb.menu.clock.8external=8 MHz (external)
attiny1634cb.menu.clock.8external.bootloader.low_fuses=0xEF
attiny1634cb.menu.clock.8external.build.f_cpu=8000000L
attiny1634cb.menu.clock.8external.bootloader.file=empty/empty_all.hex
attiny1634cb.menu.clock.737external=7.372 MHz (external)
attiny1634cb.menu.clock.737external.bootloader.low_fuses=0xEE
attiny1634cb.menu.clock.737external.build.f_cpu=7372800L
attiny1634cb.menu.clock.737external.bootloader.file=empty/empty_all.hex
attiny1634cb.menu.clock.92external=9.216 MHz (external)
attiny1634cb.menu.clock.92external.bootloader.low_fuses=0xEE
attiny1634cb.menu.clock.92external.build.f_cpu=9216000L
attiny1634cb.menu.clock.92external.bootloader.file=empty/empty_all.hex
attiny1634cb.menu.clock.11external=11.0592 MHz (external)
attiny1634cb.menu.clock.11external.bootloader.low_fuses=0xEE
attiny1634cb.menu.clock.11external.build.f_cpu=11059200L
attiny1634cb.menu.clock.11external.bootloader.file=empty/empty_all.hex
attiny1634cb.menu.clock.143external=14.7456 MHz (external - overclocked)
attiny1634cb.menu.clock.143external.bootloader.low_fuses=0xEE
attiny1634cb.menu.clock.143external.build.f_cpu=14745600L
attiny1634cb.menu.clock.143external.bootloader.file=empty/empty_all.hex
attiny1634cb.menu.clock.6external=6 MHz (external)
attiny1634cb.menu.clock.6external.bootloader.low_fuses=0xEF
attiny1634cb.menu.clock.6external.build.f_cpu=6000000L
attiny1634cb.menu.clock.6external.bootloader.file=empty/empty_all.hex
attiny1634cb.menu.clock.4external=4 MHz (external)
attiny1634cb.menu.clock.4external.bootloader.low_fuses=0xEF
attiny1634cb.menu.clock.4external.build.f_cpu=6000000L
attiny1634cb.menu.clock.4external.bootloader.file=empty/empty_all.hex
attiny1634cb.menu.clock.1internal=1 MHz (internal)
attiny1634cb.menu.clock.1internal.bootloader.low_fuses=0x62
attiny1634cb.menu.clock.1internal.build.f_cpu=1000000L
attiny1634cb.menu.clock.1internal.bootloader.file=empty/empty_all.hex
attiny1634cb.menu.clock.16external=16 MHz (external - overclocked)
attiny1634cb.menu.clock.16external.bootloader.low_fuses=0xEF
attiny1634cb.menu.clock.16external.build.f_cpu=16000000L
attiny1634cb.menu.clock.16external.bootloader.file=empty/empty_all.hex
attiny1634cb.menu.bod.disable=Disabled
attiny1634cb.menu.bod.disable.bootloader.extended_fuses=0x1F
attiny1634cb.menu.bod.disable.bootloader.high_fuses=0xD7
attiny1634cb.menu.bod.1v8=B.O.D. Enabled (1.8v)
attiny1634cb.menu.bod.1v8.bootloader.extended_fuses=0x1D
attiny1634cb.menu.bod.1v8.bootloader.high_fuses=0xD7
attiny1634cb.menu.bod.2v7=B.O.D. Enabled (2.7v)
attiny1634cb.menu.bod.2v7.bootloader.extended_fuses=0x1D
attiny1634cb.menu.bod.2v7.bootloader.high_fuses=0xD5
attiny1634cb.menu.bod.4v3=B.O.D. Enabled (4.3v)
attiny1634cb.menu.bod.4v3.bootloader.extended_fuses=0x1D
attiny1634cb.menu.bod.4v3.bootloader.high_fuses=0xD4


attiny828.name=ATtiny828
attiny828.upload.maximum_size=8192
attiny828.upload.maximum_data_size=512
attiny828.upload.tool=avrdude
attiny828.bootloader.tool=avrdude
attiny828.bootloader.unlock_bits=0x3F
attiny828.bootloader.lock_bits=0x3F
attiny828.build.mcu=attiny828
attiny828.build.core=tiny
attiny828.build.board=AVR_ATTINY828
attiny828.menu.clock.8internal=8 MHz (internal)
attiny828.menu.clock.8internal.bootloader.low_fuses=0xE2
attiny828.menu.clock.8internal.build.f_cpu=8000000L
attiny828.menu.clock.8internal.bootloader.file=empty/empty_all.hex
attiny828.menu.clock.1internal=1 MHz (internal)
attiny828.menu.clock.1internal.bootloader.low_fuses=0x62
attiny828.menu.clock.1internal.build.f_cpu=1000000L
attiny828.menu.clock.1internal.bootloader.file=empty/empty_all.hex
attiny828.menu.bod.disable=Disabled
attiny828.menu.bod.disable.bootloader.extended_fuses=0xFF
attiny828.menu.bod.disable.bootloader.high_fuses=0xD7
attiny828.menu.bod.1v8=B.O.D. Enabled (1.8v)
attiny828.menu.bod.1v8.bootloader.extended_fuses=0x5F
attiny828.menu.bod.1v8.bootloader.high_fuses=0xD7
attiny828.menu.bod.2v7=B.O.D. Enabled (2.7v)
attiny828.menu.bod.2v7.bootloader.extended_fuses=0x5F
attiny828.menu.bod.2v7.bootloader.high_fuses=0xD5
attiny828.menu.bod.4v3=B.O.D. Enabled (4.3v)
attiny828.menu.bod.4v3.bootloader.extended_fuses=0x5F
attiny828.menu.bod.4v3.bootloader.high_fuses=0xD4

attiny828opti.name=ATtiny828 (Optiboot)
attiny828opti.upload.maximum_size=7680
attiny828opti.upload.maximum_data_size=512
attiny828opti.upload.protocol=arduino
attiny828opti.upload.speed=57600
attiny828opti.upload.tool=avrdude
attiny828opti.bootloader.tool=avrdude
attiny828opti.bootloader.unlock_bits=0x3F
attiny828opti.bootloader.lock_bits=0x3F
attiny828opti.build.mcu=attiny828
attiny828opti.build.core=tiny
attiny828opti.build.board=AVR_ATTINY828
attiny828opti.bootloader.low_fuses=0xE2
attiny828opti.build.f_cpu=8000000L
attiny828opti.bootloader.file=optiboot/optiboot_attiny828at8.hex
attiny828opti.menu.bod.disable=Disabled
attiny828opti.menu.bod.disable.bootloader.extended_fuses=0xFA
attiny828opti.menu.bod.disable.bootloader.high_fuses=0xD7
attiny828opti.menu.bod.1v8=B.O.D. Enabled (1.8v)
attiny828opti.menu.bod.1v8.bootloader.extended_fuses=0x5A
attiny828opti.menu.bod.1v8.bootloader.high_fuses=0xD7
attiny828opti.menu.bod.2v7=B.O.D. Enabled (2.7v)
attiny828opti.menu.bod.2v7.bootloader.extended_fuses=0x5A
attiny828opti.menu.bod.2v7.bootloader.high_fuses=0xD5
attiny828opti.menu.bod.4v3=B.O.D. Enabled (4.3v)
attiny828opti.menu.bod.4v3.bootloader.extended_fuses=0x5A
attiny828opti.menu.bod.4v3.bootloader.high_fuses=0xD4
